1 --> Merging 2 DataFrames
2 --> Joining 2 DataFrames
3 --> Concatination 2 DataFrames

In [1]:
import numpy as np
import pandas as pd

In [3]:
employees = {
    'Id' : [1,2,3,4,5],
    'Name' : ['John','Ana','Peter','linda','bob'],
    'Dept' : ['HR','IT','FINANCE','IT','HR']
}

salaries = {
    'Id' : [1,2,3,6,7],
    'sal' : [60000,80000,65000,70000,90000],
    'Bonus' : [5000,10000,7000,8000,12000]
}

empDF = pd.DataFrame(employees)
salDF = pd.DataFrame(salaries)

In [4]:
empDF

   Id   Name     Dept
0   1   John       HR
1   2    Ana       IT
2   3  Peter  FINANCE
3   4  linda       IT
4   5    bob       HR

In [5]:
salDF

   Id    sal  Bonus
0   1  60000   5000
1   2  80000  10000
2   3  65000   7000
3   6  70000   8000
4   7  90000  12000

### Merging

In [ ]:
pd.merge(empDF,salDF,on = 'Id',how = 'inner')   #inner only gives the values which have all the data. & on = 'Id' defines on which basis merge should happen

   Id   Name     Dept    sal  Bonus
0   1   John       HR  60000   5000
1   2    Ana       IT  80000  10000
2   3  Peter  FINANCE  65000   7000

In [ ]:
pd.merge(empDF,salDF,on = 'Id' , how = 'outer')   #How = 'outer' will keep missing values null & on='Id' defines on which basis or common column merge should happen

   Id   Name     Dept      sal    Bonus
0   1   John       HR  60000.0   5000.0
1   2    Ana       IT  80000.0  10000.0
2   3  Peter  FINANCE  65000.0   7000.0
3   4  linda       IT      NaN      NaN
4   5    bob       HR      NaN      NaN
5   6    NaN      NaN  70000.0   8000.0
6   7    NaN      NaN  90000.0  12000.0

### Concatination

In [10]:
df1 = pd.DataFrame({
    'A' : ['A0','A1','A2'],
    'B' : ['B0','B1','B2'],
    'C' : ['C0','C1','C2']
})

df2 = pd.DataFrame({
    'A' : ['A3','A4','A5'],
    'B' : ['B3','B4','B5'],
    'C' : ['C3','C4','C5']
})

In [11]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [12]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [14]:
# Concatinate 2 df vertically

pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [16]:
# Concatinate 2 df horizontally

pd.concat([df1,df2],axis = 1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

### Joining